


def add_day_schedule(date: str, version: str = 'last'):
    """ Добавляет новое расписание в таблицу БД days и day_wb

    date (str) - дата по которой нужно добавить расписание в формате
    'dd.mm.yy'.
    version (str) - версия расписания не день в формате (пример) '1.2.1'.
        Применимо для получения прошлых версий расписаний для аналитики,
        возврата к старым шаблонам и пр. Также поддерживает формат 'last' -
        для получения последней версии расписания. И 'first' для первой.
    """

    # Получить расписание в виде списка для выбранной даты и версии



    # Обработать:
        # id_days
        # date
        # version
        # time_change
        # enough_time
        # first_load




    pass